Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Unlike ControlGetPos, this method applies DPI scaling to the returned coordinates (unless the -DPIScale option was used).
ja: ControlGetPosとは異なり、このメソッドは返された座標にDPIスケーリングを適用します（-DPIScaleオプションが使用されていない場合）。

source: Unlike ControlMove, this method applies DPI scaling to the coordinates (unless the -DPIScale option was used).
ja: ControlMoveとは異なり、このメソッドは座標にDPIスケーリングを適用します（-DPIScaleオプションが使用されていない場合）。

source: Unlike FileCopy, moving a file onto itself is always considered successful, even if the overwrite mode is not in effect.
ja: FileCopyとは異なり、上書きモードが有効でない場合でも、ファイルの自分自身への移動は常に成功したとみなされます。

source: Unlike FileGetAttrib, DirExist supports wildcard patterns and always returns a non-empty value if a matching folder exists.
ja: FileGetAttribとは異なり、DirExistはワイルドカードパターンをサポートし、一致するフォルダが存在する場合は常に空でない値を返します。

source: Unlike FileGetAttrib, FileExist supports wildcard patterns and always returns a non-empty value if a matching file exists.
ja: FileGetAttribとは異なり、FileExistはワイルドカードパターンをサポートし、一致するファイルが存在する場合は常に空でない値を返します。

source: Unlike FileMove, copying a file onto itself is always counted as an error, even if the overwrite mode is in effect.
ja: FileMoveと異なり、ファイルを自分自身にコピーすることは、上書きモードが有効であっても、常にエラーとしてカウントされます。

source: Unlike GuiControl.Choose(), this function raises a Change or DoubleClick event.
ja: GuiControl.Choose()とは異なり、この関数はChangeイベントまたはDoubleClickイベントを発生させます。

source: Unlike ListViews, a TreeView's ImageList is not automatically destroyed when the TreeView is destroyed.
ja: ListViewとは異なり、TreeViewのImageListは、TreeViewが破棄されたときに自動的に破棄されることはありません。

source: Unlike Send, the Click function does not automatically release the modifier keys (Ctrl, Alt, Shift, and Win).
ja: Send関数と違って、Click関数は修飾キー（Ctrl、Alt、Shift、Win）を自動的に解除することはありません。

source: Unlike SendInput and SendEvent, the user may interrupt a SendPlay by pressing Ctrl+Alt+Del or Ctrl+Esc.
ja: SendInputやSendEventとは異なり、ユーザーはCtrl+Alt+DelまたはCtrl+Escを押してSendPlayを中断できます。

source: Unlike SendMessage, PostMessage usually only sends basic numeric values, not pointers to structures or strings.
ja: SendMessageとは異なり、PostMessageは通常、基本的な数値のみを送信し、構造体や文字列へのポインタは送信しません。

source: Unlike Suspend -- which disables hotkeys and hotstrings -- turning on pause will freeze the thread (the current thread if NewState was omitted, otherwise the underlying thread).
ja: ホットキーや ホットストリングを無効にするSuspendとは異なり、pauseをオンにするとスレッド（NewStateが省略された場合は現在のスレッド、そうでない場合はその下のスレッド）がフリーズします。

source: Unlike WinActivate, the Last Found Window cannot be used because it might not be the bottommost window.
ja: WinActivateとは異なり、Last Found Windowは最下部のウィンドウでない可能性があるため使用できない。

source: Unlike WinGetClientPos, this method applies DPI scaling to Width and Height (unless the -DPIScale option was used).
ja: WinGetClientPosとは異なり、このメソッドはWidthと Heightに DPIスケーリングを適用します（-DPIScaleオプションが使用されていない場合）。

source: Unlike WinGetPos, this method applies DPI scaling to Width and Height (unless the -DPIScale option was used).
ja: WinGetPosとは異なり、このメソッドはWidthと Heightに DPIスケーリングを適用します（-DPIScaleオプションが使用されていない場合）。

source: Unlike WinMove, this method applies DPI scaling to Width and Height (unless the -DPIScale option was used).
ja: WinMoveとは異なり、この方法ではWidthと Heightに DPIスケーリングを適用します（-DPIScaleオプションが使用されていない場合）。

source: Unlike WinWaitActive, the Last Found Window cannot be used.
ja: WinWaitActiveとは異なり、Last Found Windowは使用できない。

source: Unlike printf, size specifiers are not supported.
ja: printfと異なり、サイズ指定子はサポートされていない。

source: Unlike static initializers, the initializers of locals and globals execute every time the function is called.
ja: 静的イニシャライザとは異なり、ローカルとグローバルのイニシャライザは、関数が呼ばれるたびに実行されます。

source: Unlike FileExist and DirExist, this must be a true filename, not a pattern.
ja: FileExistや DirExistとは異なり、パターンではなく、本当のファイル名でなければなりません。

source: Unlike IsSet(A) ? A : B, a VarUnset warning may still be shown at load-time if there are other references to the variable but no assignments.
ja: IsSet(A) ? A : Bと異なり、変数への他の参照があるが代入がない場合、ロード時にVarUnset 警告が表示されることがあります。

source: Unlike EndChars above, the #Hotstring directive is positional when used this way.
ja: 上記のEndCharsとは異なり、#Hotstringディレクティブをこのように使用した場合は位置指定になります。

source: Unlike Ctrl/Alt/Shift, there is no generic/neutral "Win" key because the OS does not support it.
ja: Ctrl/Alt/Shiftとは異なり、OS がサポートしていないため、汎用/中立の「Win」キーはありません。

source: Unlike Run, RunWait will wait until Target is closed or exits, at which time the return value will be the program's exit code (as a signed 32-bit integer).
ja: RunWaitはRunと異なり、Targetがクローズされるか終了するまで待機し、その時の戻り値はプログラムの終了コード（符号付き32ビット整数）となります。

source: Unlike Run, RunWait will wait until the program finishes before continuing.
ja: Runとは異なり、RunWaitはプログラムが終了するまで待機してから続行します。

source: Unlike a normal function-call, the arrival of a monitored message calls the function as a new thread.
ja: 通常の関数呼び出しとは異なり、監視メッセージの到着は、新しいスレッドとして関数を呼び出します。

source: Unlike a v1 installation, a default version is not selected during installation.
ja: v1のインストールとは異なり、インストール時にデフォルトのバージョンは選択されません。

source: Unlike address-of in v1, it can be used with literal strings and temporary strings.
ja: v1のaddress-ofとは異なり、リテラル文字列と一時的な文字列で使用することができます。

source: Unlike an If statement, an Else statement supports any type of statement immediately to its right.
ja: If文とは異なり、Else文はその右側にあるどのタイプの文もサポートします。

source: Unlike arithmetic bit shift right, this does not preserve the sign of the number.
ja: 算術ビットシフト右とは異なり、これは数値の符号を保持しない。

source: Unlike functions that change a control, ControlGetPos does not have an automatic delay (SetControlDelay does not affect it).
ja: コントロールを変更する関数とは異なり、ControlGetPosには自動遅延はありません（SetControlDelayは影響しません）。

source: Unlike high-priority threads, events that occur while the thread is uninterruptible are not discarded.
ja: 優先度の高いスレッドとは異なり、スレッドが中断できない間に発生したイベントは破棄されない。

source: Unlike in C/C++, #Include does nothing if the file has already been included by a previous directive.
ja: C/C++とは異なり、#Includeは、そのファイルが既に以前の指令によってインクルードされていた場合、何もしません。

source: Unlike in v1, a property or method cannot be accidentally disabled by assigning an array element.
ja: v1とは異なり、配列の要素を代入することで誤ってプロパティやメソッドを無効化することはできません。

source: Unlike most of the similar variables, if the folder is the root of a drive, the final backslash is not included (e.g. it would contain M: rather than M:\).
ja: 類似の変数の多くとは異なり、フォルダがドライブのルートである場合、最後のバックスラッシュは含まれない（例えば、M:\ではなくM:が含まれる）。

source: Unlike most other GUI events, the ContextMenu event can have more than one concurrent thread.
ja: 他の多くのGUIイベントとは異なり、ContextMenuイベントは複数のスレッドを同時に持つことができます。

source: Unlike most other ListView styles, this one cannot be changed after the ListView is created.
ja: 他の多くのListViewスタイルと異なり、このスタイルはListViewの作成後に変更することができない。

source: Unlike most other operators, assignments are evaluated from right to left.
ja: 他のほとんどの演算子とは異なり、代入は右から左に評価される。

source: Unlike notepad.exe, wordpad.exe cannot be found by checking each directory listed in the PATH environment variable.
ja: wordpad.exeはnotepad.exeと異なり、環境変数PATHに記載されている各ディレクトリを確認しても見つけることができない。

source: Unlike subroutines, if one forgets to define the end of a function, one is usually alerted to the error as each { must have a corresponding }.
ja: サブルーチンとは異なり、関数の終わりを定義し忘れると、{には、それぞれ対応する}が必要なので、通常、エラーになります。

source: Unlike the Send function, mouse clicks cannot be sent by ControlSend.
ja: Send関数とは異なり、ControlSendではマウスクリックを送信することはできません。

source: Unlike the Select option below, expanding an item does not automatically expand its parent.
ja: 下の「選択」オプションとは異なり、項目を展開してもその親項目は自動的に展開されません。

source: Unlike the EndKeys parameter, the state of the Shift key is ignored.
ja: EndKeysパラメータとは異なり、Shiftキーの状態は無視されます。

source: Unlike the Input command, InputHook can be used to detect keys which do not produce text, without terminating the Input.
ja: Inputコマンドとは異なり、InputHookはInputを終了させることなく、テキストを生成しないキーを検出するために使用することができます。

source: Unlike the SM_CMONITORS system property retrieved via SysGet(80), the return value includes all monitors, even those not being used as part of the desktop.
ja: SysGet(80)で取得したSM_CMONITORSシステムプロパティとは異なり、デスクトップの一部として使用されていないモニターも含めて、すべてのモニターが返されます。

source: Unlike the Safely Remove Hardware option, this only dismounts the volume identified by the Drive parameter, not the overall device.
ja: ハードウェアの安全な取り外し」オプションとは異なり、デバイス全体ではなく、ドライブパラメータで特定されたボリュームのみをマウント解除します。

source: Unlike the other prefix symbols, the tilde prefix is allowed to be present on some of a hotkey's variants but absent on others.
ja: 他の接頭語記号と異なり、チルダ接頭語は、ホットキーのいくつかのバリエーションに存在し、他のバリエーションには存在しないことが許されています。

source: Unlike the other sending modes, the operating system limits SendInput to about 5000 characters (this may vary depending on the operating system's version and performance settings).
ja: 他の送信モードと異なり、オペレーティングシステムではSendInputは約5000文字に制限されています（オペレーティングシステムのバージョンや性能設定により異なる場合があります）。

source: Unlike the read-only built-in variables, these cannot be returned by a dynamic reference.
ja: 読み取り専用の組み込み変数とは異なり、動的参照で返すことはできません。

source: Unlike the switch statement found in some other languages, there is no implicit fall-through and Break is not used (except to break out of an enclosing loop).
ja: 他のいくつかの言語で見られるswitch文とは異なり、暗黙のフォールスルーはなく、Breakは（ループを囲むループから抜け出す場合を除き）使用されない。

source: Unlike v1, the Win32 menu is destroyed only when the object is deleted.
ja: v1とは異なり、Win32メニューはオブジェクトが削除されたときのみ破棄されます。

source: Unlike variables such as A_ThisHotkey, each thread retains its own value for A_EventInfo.
ja: A_ThisHotkeyなどの変数とは異なり、各スレッドは、A_EventInfoの値を保持します。

source: Unlocks the D drive.
ja: Dドライブのロックを解除します。

source: Unminimizes or unmaximizes Notepad if it is minimized or maximized.
ja: メモ帳が最小化または最大化されている場合、最小化または最大化を解除します。

source: Unminimizes or unmaximizes the specified window if it is minimized or maximized.
ja: 指定されたウィンドウが最小化または最大化されている場合、最小化または最大化を解除します。

source: Unminimizes or unmaximizes the window, if necessary.
ja: 必要に応じて、ウィンドウの最小化または最大化を解除します。

source: Unneeded tabs scroll to the opposite side of the control when a tab is selected.
ja: タブを選択すると、不要なタブはコントロールの反対側にスクロールする。

source: Unpauses the underlying thread.
ja: 基礎となるスレッドの一時停止を解除します。

source: Unquoted percent signs in expressions are used only for double-derefs/dynamic references, and having an odd number of them is a syntax error.
ja: 式中の引用符なしのパーセント記号は、二重参照／動的参照にのみ使用され、奇数個あると構文エラーになります。

source: Unset Parameters
ja: アンセットパラメータ

source: Unsigned decimal integer.
ja: 符号なし10進数整数。

source: Unsigned hexadecimal integer; uses "abcdef" or "ABCDEF" depending on the case of x.
ja: 符号なし16進数整数。xのケースによって「abcdef」または「ABCDEF」を使用します。

source: Unsigned octal integer.
ja: 8進数の符号なし整数。

source: Unsorted:
ja: アンソートです：

source: Unsupported prefix key.
ja: 未対応のプレフィックスキーです。

source: Until - Syntax & Usage | AutoHotkey v2
ja: Until - 構文と使用法｜AutoHotkey v2

source: Until then, here's an explanation of the above code:
ja: それまでは、上のコードの説明をどうぞ：

source: Unwanted behavior may also occur if a monitor function returns an integer to suppress further processing of a message, but the system expected different processing or a different response.
ja: また、モニター関数が整数値を返してメッセージのさらなる処理を抑制しているにもかかわらず、システムが別の処理または別の応答を期待していた場合にも、望ましくない動作が発生することがあります。

source: Up to 19 variables are supported, if supported by the enumerator.
ja: 列挙者がサポートしている場合、最大19個の変数がサポートされます。

source: Up to 19 variables can be used.
ja: 最大19個の変数を使用することができます。

source: UpDown Control Styles
ja: UpDownコントロールのスタイル

source: UpdateOSD() ; Make the first update immediate rather than waiting for the timer.
ja: UpdateOSD() ; 最初の更新をタイマー待ちではなく、即時更新します。

source: Upon creation, each ImageList is empty.
ja: 作成時、各 ImageList は空である。

source: Upon return, the value is copied from the temporary var back into the caller's variable.
ja: リターン時には、一時的な変数から呼び出し元の変数に値がコピーされます。

source: Upon selecting a favorite, the script will instantly switch to that folder within the active window.
ja: お気に入りを選択すると、スクリプトは即座にアクティブウィンドウ内のそのフォルダに切り替わります。

source: Usage
ja: 使用方法

source: Usage details regarding the SoundGet and SoundSet functions.
ja: SoundGet 関数と SoundSet 関数の使用法の詳細。

source: Usage examples:
ja: 使用例：

source: Usage is now Output := Sort(Input [, Options, Callback]).
ja: 使い方は、Output := Sort(Input [, Options, Callback])になりました。

source: Usage is now Output := Sort(Input [, Options, Function]).
ja: 使い方は、Output := Sort(Input [, Options, Function])になりました。

source: Usage of Clone, Delete, InsertAt, Pop, Push and RemoveAt is basically unchanged.
ja: Clone、Delete、InsertAt、Pop、Push、RemoveAtの使い方は基本的に変わりません。

source: Usage:
ja: 使用方法：

source: Use "Enter" and "Pause" instead.
ja: 代わりに「Enter」「Pause」を使ってください。

source: Use +/-TickInterval to have more flexibility.
ja: より柔軟性を持たせるには+/-TickIntervalを使う。

source: Use -1 for no delay at all (default) and 0 for the smallest possible delay (however, if the Play parameter is present, both 0 and -1 produce no delay).
ja: 遅延が全くない場合（デフォルト）には-1、可能な限り小さい遅延の場合（ただし、Playパラメータが存在する場合、0と-1の両方が遅延を生じない）には0を使用します。

source: Use -1 for no delay at all and 0 for the smallest possible delay (however, if the Play parameter is present, both 0 and -1 produce no delay).
ja: 遅延が全くない場合は-1、可能な限り小さい場合は0を使用します（ただし、Playパラメータが存在する場合は、0と-1の両方で遅延は発生しません）。

source: Use -1 for no delay at all and 0 for the smallest possible delay.
ja: 遅延が全くない場合は-1、可能な限り小さな遅延の場合は0を使用します。

source: Use /restart and /force instead.
ja: 代わりに/restartと/forceを使用してください。

source: Use A_HotkeyInterval instead.
ja: A_HotkeyIntervalで代替

source: Use ControlSend.
ja: ControlSendを使用します。

source: Use EnvGet instead if an equivalent built-in variable is not available.
ja: 同等の組み込み変数がない場合は、代わりにEnvGetを使用します。

source: Use ExitApp to completely terminate a script that is persistent.
ja: ExitAppを使用して、永続的なスクリプトを完全に終了させることができます。

source: Use FormatTime or built-in variables for date and time.
ja: 日付と時刻にはFormatTimeまたは組み込み変数を使用します。

source: Use Gui.Submit.
ja: Gui.Submitを使用します。

source: Use GuiCtrl.Choose to select an item.
ja: GuiCtrl.Chooseで項目を選択します。

source: Use InStr instead.
ja: InStrで代替

source: Use Ord instead.
ja: Ordで代替

source: Use SetWorkingDir or assign a path to A_WorkingDir to change the working directory.
ja: 作業ディレクトリを変更するには、SetWorkingDirを使用するか、A_WorkingDirにパスを割り当てる。

source: Use SoundGetMute to retrieve the current mute setting.
ja: 現在のミュート設定を取得するには、SoundGetMuteを使います。

source: Use SoundGetVolume to retrieve the current volume setting.
ja: 現在の音量設定を取得するには、SoundGetVolumeを使用してください。

source: Use StrSplit instead.
ja: StrSplitで代替

source: Use Trim instead.
ja: Trimで代替

source: Use WinRestore or WinMaximize to unminimize a window.
ja: ウィンドウの最小化を解除するには、WinRestoreまたはWinMaximizeを使用します。

source: Use WinRestore to unmaximize a window and WinMinimize to minimize it.
ja: ウィンドウの最大化を解除するにはWinRestoreを使用し、最小化するにはWinMinimizeを使用する。

source: Use WinRestore to unmaximize a window or WinMinimize to minimize it.
ja: 最大化を解除するにはWinRestore関数を、最小化するにはWinMinimize関数を使用してください。

source: Use WinRestore to unminimize a window or WinMaximize to maximize it.
ja: 最小化を解除するにはWinRestore関数を、最大化するにはWinMaximize関数を使います。

source: Use WinShow to unhide a hidden window (DetectHiddenWindows can be either On or Off to do this).
ja: WinShow関数を使って、隠しウィンドウを解除することができます（DetectHiddenWindows関数は、これをオンまたはオフにすることができます）。

source: Use WinWait, WinWaitClose or WinWait[Not]Active.
ja: WinWait、WinWaitClose、WinWait[Not]Activeを使用してください。

source: Use built-in variables for hotkeys as follows:
ja: ホットキーには、以下のように組み込み変数を使用します：

source: Use ControlClick for that.
ja: その際はControlClickを使用してください。

source: Use GuiCtrl.Enabled to enable it later.
ja: 後から有効にする場合は、GuiCtrl.Enabledを使用します。

source: Use GuiCtrl.Visible to show it later.
ja: 後で表示する場合はGuiCtrl.Visibleを使用します。

source: Use NumGet instead.
ja: 代わりにNumGetを使用してください。

source: Use SetMouseDelay to change the length of the delay.
ja: ディレイの長さを変更する場合は、SetMouseDelayを使用します。

source: Use #MaxThreadsPerHotkey to change this behavior.
ja: この動作を変更するには#MaxThreadsPerHotkeyを使います。

source: Use IsSet to determine whether the parameter has been given a value, as shown below:
ja: IsSetを使用して、以下のように、パラメータに値が与えられているかどうかを判断します：

source: Use StrLen to determine whether additional time components are present.
ja: StrLenを使用して、追加の時間コンポーネントが存在するかどうかを判断します。

source: Use Try/Catch instead.
ja: 代わりにTry/Catchを使用します。

source: Use concatenation or Format to include variables in text.
ja: テキストに変数を含めるには、連結や Formatを使用します。

source: Use HotIfWin... MyTitleVar to set the criteria and Hotkey KeyName, Label to create the hotkey variant.
ja: HotIfWin... MyTitleVarで条件を設定し、Hotkey KeyName, Labelでホットキーのバリアントを作成します。

source: Use SetControlDelay -1 prior to ControlClick.
ja: ControlClickの前にSetControlDelay -1を使ってください。

source: Use Map(Key, Value, ...) to create a map from a list of key-value pairs.
ja: キーと値のペアのリストからマップを作成するには、Map(Key, Value, ...)を使用します。

source: Use MyFunc in place of "MyFunc" when passing the function to any built-in function such as SetTimer or Hotkey.
ja: SetTimerや Hotkeyなどの組み込み関数に渡す場合は、MyFuncの代わりに"MyFunc"を使用してください。

source: Use MyFunc in place of Func("MyFunc").
ja: Func("MyFunc")の代わりにMyFuncを使用します。

source: Use MyInteger := NumGet(MyStruct, 4, "UInt") to retrieve any desired integers from the structure.
ja: MyInteger := NumGet(MyStruct, 4, "UInt")を使って、構造体から任意の整数を取得します。

source: Use ahk_class ClassName in WinTitle to identify a window by its window class.
ja: ウィンドウクラスでウィンドウを識別するにはWinTitleのahk_class ClassNameを使う。

source: Use ahk_exe ProcessNameOrPath in WinTitle to identify a window belonging to any process with the given name or path.
ja: WinTitleのahk_exe ProcessNameOrPathを使って、与えられた名前やパスを持つプロセスに属するウィンドウを特定する。

source: Use ahk_group GroupName in WinTitle to identify a window or windows matching the rules contained by a previously defined window group.
ja: WinTitleの ahk_group GroupNameを使用して、以前に定義されたウィンドウグループに含まれるルールに一致するウィンドウを特定する。

source: Use ahk_id HWND, HWND (that is, an Integer without the ahk_id keyword) or an Object with a HWND property in WinTitle to identify a window or control by its unique ID.
ja: ahk_idHWNDを使用する、 HWND(つまり、ahk_id キーワードのない整数)、またはWinTitleの HWND プロパティを持つオブジェクトを使用して、一意の ID でウィンドウやコントロールを識別する。

source: Use ahk_pid PID in WinTitle to identify a window belonging to a specific process.
ja: WinTitleでahk_pid PIDを使用して、特定のプロセスに属するウィンドウを識別する。

source: Use myVar() in place of %myVar%() when calling a function by value.
ja: 関数を値で呼び出す場合、%myVar%()の代わりにmyVar()を使用します。

source: Use {{} and {}} to include literal braces in the string.
ja: 文字列の中にリテラルブレースを含めるには、{{}と {}}を使用します。

source: Use +Parent immediately followed by the HWND of any window or control to use it as the parent of this window.
ja: ウィンドウやコントロールのHWNDに続けて +Parentを使用すると、そのウィンドウの親として使用することができます。

source: Use -Tabstop (i.e. minus Tabstop) to have an input-capable control skipped over when the user presses Tab to navigate.
ja: ユーザーがTabキーを押して移動する際に、入力可能なコントロールがスキップされるようにするには、-Tabstop（すなわちマイナスTabstop）を使用します。

source: Use GuiCtrl.Opt("+Background") to remove this option later.
ja: このオプションを後で削除するには、GuiCtrl.Opt("+Background")を使用します。

source: Use MyGui.Opt("-DPIScale") to disable DPI scaling, which is enabled by default.
ja: デフォルトで有効になっているDPIスケーリングを無効にするには、MyGui.Opt("-DPIScale")を使用します。

source: Use OnMessage(x, MyFunc) where MyFunc is literally the name of a function, but note that the v1 equivalent would be OnMessage(x, Func("MyFunc")), which allows other functions to continue monitoring message x, unlike OnMessage(x, "MyFunc").
ja: OnMessage(x, MyFunc)を使用します。MyFuncは文字通り関数の名前ですが、v1と同等のものはOnMessage(x, Func("MyFunc"))で、OnMessage(x, "MyFunc")と異なり、他の関数がメッセージxを監視し続けることができることに注意してください。

source: Use String(x) to convert a value to a string; this calls .ToString() if x is an object.
ja: 値を文字列に変換するにはString(x)を使用します。xがオブジェクトの場合、.ToString()を呼び出します。

source: Use IsVariadic to detect when there is no upper bound.
ja: IsVariadicを使用して、上限がないことを検出します。

source: Use NamedCtrlContents.NameOfControl to retrieve an individual value or OwnProps to enumerate them all.
ja: 個々の値を取得するにはNamedCtrlContents.NameOfControlを使用し、すべてを列挙するにはOwnPropsを使用します。

source: Use StrCompare(a, b, CaseSense) instead.
ja: 代わりにStrCompare(a, b, CaseSense)を使用してください。

source: Use +Owner to make the window owned by another.
ja: ウィンドウを他の人が所有するようにするには、+Ownerを使用します。

source: Use C0 to turn case sensitivity back off.
ja: C0で大文字小文字の区別をオフに戻す。

source: Use ?0 to turn this option back off.
ja: このオプションをオフに戻すには、?0を使用します。

source: Use Z0 to turn this option back off.
ja: このオプションをオフに戻すには、Z0を使用します。

source: Use O0 (the letter O followed by a zero) to turn this option back off.
ja: このオプションをオフに戻すには、O0（アルファベットのOの後にゼロが続く）を使用します。

source: Use R0 to turn this option back off, or override it with T.
ja: R0でこのオプションをオフに戻すか、Tで上書きしてください。

source: Use T0 or R0 to turn this option back off, or override it with R.
ja: このオプションをオフに戻すにはT0またはR0を使用し、Rでオーバーライドします。

source: Use GDI+ to load the image, if available.
ja: GDI+を使用して、画像を読み込むことができる場合は、それを使用します。

source: Use IsSet to check a variable directly, as in IsSet(MyGlobalVar).
ja: IsSet(MyGlobalVar)のように、変数を直接チェックする場合は、IsSetを使用します。

source: Use IsSetRef to check a VarRef, which would typically be contained by a variable, as in the example below.
ja: IsSetRefを使用すると、以下の例のように、通常変数に含まれるVarRefをチェックすることができます。

source: Use OnError to implement alternative error handling methods.
ja: OnErrorを使用して、代替のエラー処理方法を実装します。

source: Use Pause to halt the script, such as to inspect variables.
ja: 変数を検査するなど、スクリプトを停止させたいときはPause関数を使用します。

source: Use SendPlay via the SendPlay function, SendMode Play and/or the hotstring option SP.
ja: SendPlay関数、SendMode Play、および／または、ホットストリングオプションSPを使用して、SendPlayを使用します。

source: Use Value instead of Text if AltSubmit was used (but Value returns 0 if Text does not match a list item).
ja: AltSubmitが使用された場合、Textの代わりにValueを使用する（ただし、Textがリスト項目に一致しない場合、Valueは0を返します）。

source: Use Value instead of Text if AltSubmit was used.
ja: AltSubmitが使用されていた場合、Textの代わりにValueを使用します。

source: Use Window Spy (available in tray icon menu) or the example at the bottom of this page to determine the colors currently on the screen.
ja: Window Spy（トレイアイコンメニューで利用可能）またはこのページの下にある例で、現在画面に表示されている色を確認することができます。

source: Use Window Spy to determine which text of the currently-active window is hidden.
ja: Window Spyを使用して、現在アクティブなウィンドウのどのテキストが隠されているかを判断します。

source: Use a command line such as "AutoHotkey32_UIA.exe" "Your script.ahk" (but include full paths where necessary).
ja: コマンドラインは、"AutoHotkey32_UIA.exe" "Your script.ahk"(ただし、必要に応じてフルパスを含める) のように使用します。

source: Use a continuation section to enhance readability and maintainability.
ja: 読みやすさと保守性を高めるために、続きのセクションを使用します。

source: Use a Buffer to receive a string from an external function via DllCall.
ja: Bufferを使って、DllCallで外部関数から文字列を受け取ります。

source: Use a constant expression such as #HotIf WinActive("ahk_group MyGroup") and define the window group with GroupAdd "MyGroup", MyTitleVar elsewhere in the script.
ja: 定数式は#HotIf WinActive("ahk_group MyGroup")のようにし、スクリプト内の別の場所でGroupAdd "MyGroup", MyTitleVarでウィンドウグループを定義します。

source: Use a decimal (not hexadecimal) number as the priority.
ja: 優先順位として10進数（16進数ではない）を使用します。

source: Use a plain B to turn backspacing back on after it was previously turned off.
ja: 単にBだけをオプションに使用すると、一度オフにしたバックスペースを再びオンにすることができます。

source: Use a program like KeyTweak (freeware) to visually remap your keys.
ja: KeyTweak（フリーウェア）のようなプログラムを使って、キーのマッピングを視覚的に変更する。

source: Use a sign (+ or -) to prefix the output value if it is of a signed type.
ja: 出力値が符号付きである場合、符号（+または-）を前置詞として使用します。

source: Use a space to prefix the output value with a single space if it is signed and positive.
ja: 出力値が符号付きで正数である場合、スペースを1つ使って前置します。

source: Use a variable to receive a string from an external function via DllCall.
ja: 変数を使用して、DllCallを介して外部関数から文字列を受け取る。

source: Use another hotkey such as Numpad0::Send "{Numpad0}" to replicate the key's original function.
ja: Numpad0::Send "{Numpad0}"など、別のホットキーを使って、キー本来の機能を再現します。

source: Use any keys as modifiers
ja: 任意のキーをモディファイアとして使用します
